#include <stdio.h>

int polynomial(int n);

int main() {
    int i, number, array[10];
    for(i = 0; i < 10; i++) {
        array[i] = polynomial(i + 1);
    }

    printf("Enter a number between 0 and 9: ");
    scanf("%d", &number);
    printf("array[%d] has stored the value of f(%d) = %d\n", number, number+1, array[number]);

    return 0;
}
/*
    Εδώ το πρόβλημα είναι πολύ απλό, όμως θέλει αναδρομική συνάρτηση. Εάν ζητηθεί η τιμή
    για n = 1, τότε επιστρέφει 1 από τον ορισμό. Σε κάθε άλλη περίπτωση πρώτα υπολογίζει
    την τιμή του f(n - 1) και μετά επιστρέφει το αποτέλεσμα της συνάρτησης f(n) = n^2 + f(n-1)

    Έστω για n = 4:
        Μπαίνει την πρώτη φορά και αφού δεν είναι και αφού δεν είναι 1 ξανακαλεί την συνάρτηση
        για n = 3:
            αφού ούτε τώρα είναι 1 ξανακαλεί τη συνάρτηση
            για n = 2:
                αφού ούτε τώρα είναι 1 ξανακαλεί τη συνάρτηση
                για n = 1:
                    τώρα εφόσον είναι 1 επιστρέφει 1
                με τιμή temp = 1 επιστρέφει 2^2 + 1 = 5
            με τιμή temp = 5 επιστρέφει 3^2 + 5 = 14
        με τιμή temp = 14 επιστρέφει 4^2 + 14 = 30 που είναι και η τιμή που ζητάει

    Φαντάζομαι ότι είναι τόσο απλό που κάνω μαλακία που το εξηγώ τόσο πολύ, απλά εγώ όταν διαβάζω
    κάτι που γράφει κάποιος άλλος σκαλώνω κι ας είναι εύκολο :Ρ
*/
int polynomial(int n) {
    // f(1) = 1
    if(n == 1) return 1;
    else {
        int temp = polynomial(n - 1);
        return (n*n + temp);
    }
}
